erp3l/src/Catalogs/ВидыДоходовНДФЛ/ВидыДоходовНДФЛ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыДоходовНДФЛ</name>
  <comment>АПК:413 ОбработкаПолученияДанныхВыбора для сортировки, допустима история выбора при вводе</comment>
  <predefined>
    <items>
      <name>Код1010</name>
      <description>Дивиденды</description>
    </items>
    <items>
      <name>Код1211</name>
      <description>Доходы, полученные в виде сумм страховых взносов по договорам страхования, если указанные суммы вносятся за физических лиц из средств работодателей</description>
    </items>
    <items>
      <name>Код1300</name>
      <description>Доходы, полученные налогоплательщиком от использования в РФ авторских или иных смежных прав (кроме авторских вознаграждений)</description>
    </items>
    <items>
      <name>Код1500</name>
      <description>Доходы по договорам купли-продажи (мены) ценных бумаг, налогообложение которых производится в соответствии с абзацем третьим пункта 1 статьи 226 НК РФ</description>
    </items>
    <items>
      <name>Код1530</name>
      <description>Доходы, полученные по операциям купли-продажи ценных бумаг, обращающихся на организованном рынке ценных бумаг</description>
    </items>
    <items>
      <name>Код1531</name>
      <description>Доходы, полученные по операциям купли-продажи ценных бумаг, не обращающихся на организованном рынке ценных бумаг</description>
    </items>
    <items>
      <name>Код1532</name>
      <description>Доходы, полученные по операциям с финансовыми инструментами срочных сделок, базисным активом по которым являются ценные бумаги или фондовые индексы</description>
    </items>
    <items>
      <name>Код1533</name>
      <description>Доходы, полученные от продажи и погашения инвестиционных паев паевых инвестиционных фондов</description>
    </items>
    <items>
      <name>Код1535</name>
      <description>Доходы, полученные по операциям с финансовыми инструментами срочных сделок, базисным активом которых не являются ценные бумаги или фондовые индексы</description>
    </items>
    <items>
      <name>Код1536</name>
      <description>Доход полученные по операциям купли-продажи ценных бумаг, не обращающихся на организованном рынке ценных бумаг, но отвечавших его требованиям</description>
    </items>
    <items>
      <name>Код1537</name>
      <description>Доходы в виде процентов по займу, полученные по совокупности операций РЕПО</description>
    </items>
    <items>
      <name>Код1538</name>
      <description>Доходы в виде процентов, полученные в налоговом периоде по совокупности договоров займа</description>
    </items>
    <items>
      <name>Код1539</name>
      <description>Доходы по операциям, связанным с открытием короткой позиции, являющимся объектом операций РЕПО</description>
    </items>
    <items>
      <name>Код1541</name>
      <description>Доходы, получаемые в результате обмена ценных бумаг, переданных по первой части РЕПО</description>
    </items>
    <items>
      <name>Код1543</name>
      <description>Доходы по операциям, учитываемым на индивидуальном инвестиционном счете</description>
    </items>
    <items>
      <name>Код1544</name>
      <description>Доходы по операциям с ценными бумагами, обращающимися на организованном рынке ценных бумаг, учитываемым на индивидуальном инвестиционном счете</description>
    </items>
    <items>
      <name>Код1545</name>
      <description>Доходы по операциям с ценными бумагами, не обращающимися на организованном рынке ценных бумаг, учитываемым на индивидуальном инвестиционном счете</description>
    </items>
    <items>
      <name>Код1546</name>
      <description>Доходы по опер. с произв.фин-выми инстр-ми, обр-ся на орг.рынке и базисным активом кот.явл. цен.бум., фонд.индексы и пр., учит. на инд. инвест.счете</description>
    </items>
    <items>
      <name>Код1547</name>
      <description>Доходы по операциям с производными финансовыми инструментами, не обращающимися на орг. рынке ценных бумаг, учитываемым на индивидуальном инвест.счете</description>
    </items>
    <items>
      <name>Код1548</name>
      <description>Доходы по опер. с произв.фин-выми инстр., обр-ся на орг.рынке и базисным активом кот. не явл. цен.бум., фонд.индексы и пр., учит. на инд.инвест.счете</description>
    </items>
    <items>
      <name>Код1549</name>
      <description>Доходы по опер. с ценными бум., не обр-ся на орг.рынке ц.бумаг, кот. при приобретении отвечали треб-ям для обр-хся ц.бум., учит. на инд. инвест.счете</description>
    </items>
    <items>
      <name>Код1551</name>
      <description>Доходы в виде процентов по займу, полученные по совокупности операций РЕПО, учитываемых на индивидуальном инвестиционном счете</description>
    </items>
    <items>
      <name>Код1552</name>
      <description>Доходы в виде процентов, полученных в налоговом периоде по совокупности договоров займа, учитываемых на индивидуальном инвестиционном счете</description>
    </items>
    <items>
      <name>Код1553</name>
      <description>Доходы по операциям, связанным с открытием короткой позиции, являющимся объектом операций РЕПО, учитываемых на индивидуальном инвестиционном счете</description>
    </items>
    <items>
      <name>Код1554</name>
      <description>Доходы, получаемые в результате обмена ценных бумаг, переданных по первой части РЕПО, учитываемых на индивидуальном инвестиционном счете</description>
    </items>
    <items>
      <name>КодДоходаПоУмолчанию</name>
      <description>Вознаграждение за выполнение трудовых или иных обязанностей; денежное содержание и иные налогооблагаемые выплаты военнослужащим и приравненным к ним</description>
    </items>
    <items>
      <name>Код2002</name>
      <description>Суммы премий за производственные результаты, предусмотренные зак-вом РФ, трудовыми (коллективными) договорами кроме доходов с кодом 2003</description>
    </items>
    <items>
      <name>Код2003</name>
      <description>Суммы вознаграждений, выплачиваемых за счет средств прибыли организации, средств специального назначения или целевых поступлений</description>
    </items>
    <items>
      <name>Код2004</name>
      <description>Суммы выплат ежемесячного денежного вознаграждения за классное руководство педагогическим работникам за счет средств федерального бюджета</description>
    </items>
    <items>
      <name>Код2010</name>
      <description>Выплаты по договорам гражданско-правового характера (за исключением авторских вознаграждений)</description>
    </items>
    <items>
      <name>Код2013</name>
      <description>Сумма компенсации за неиспользованный отпуск</description>
    </items>
    <items>
      <name>Код2014</name>
      <description>Сумма выплаты в виде выходного пособия, среднего месячного заработка, превышающей 3-х кратный размер среднего заработка</description>
    </items>
    <items>
      <name>Код2201</name>
      <description>Авторские вознаграждения (вознаграждения) за создание литературных произведений, в том числе для театра, кино, эстрады и цирка</description>
    </items>
    <items>
      <name>Код2202</name>
      <description>Авторские вознаграждения (вознаграждения) за создание художественно-графических произведений, фоторабот для печати, произведений архитектуры и дизайна</description>
    </items>
    <items>
      <name>Код2203</name>
      <description>Авторские вознаграждения (вознаграждения) за создание произведений скульптуры, живописи, театрально- и кинодекорационного искусства и графики</description>
    </items>
    <items>
      <name>Код2204</name>
      <description>Авторские вознаграждения (вознаграждения) за создание аудиовизуальных произведений (видео-, теле- и кинофильмов)</description>
    </items>
    <items>
      <name>Код2205</name>
      <description>Авторские за создание музыкальных произведений: музыкально-сценических, симфонических, хоровых, камерных, для духового оркестра, для фильмов и театра</description>
    </items>
    <items>
      <name>Код2206</name>
      <description>Авторские вознаграждения (вознаграждения) за создание других музыкальных произведений, в том числе подготовленных к опубликованию</description>
    </items>
    <items>
      <name>Код2207</name>
      <description>Авторские вознаграждения (вознаграждения) за исполнение произведений литературы и искусства</description>
    </items>
    <items>
      <name>Код2208</name>
      <description>Авторские вознаграждения (вознаграждения) за создание научных трудов и разработок</description>
    </items>
    <items>
      <name>Код2209</name>
      <description>Авторские вознаграждения за открытия, изобретения, промышленные образцы</description>
    </items>
    <items>
      <name>Код2210</name>
      <description>Вознаграждение, выплачиваемое наследникам (правопреемникам) авторов произведений науки, литературы, искусства, открытий, изобретений и пром. образцов</description>
    </items>
    <items>
      <name>Код2610</name>
      <description>Материальная выгода, полученная от экономии на процентах за пользование заемными (кредитными) средствами </description>
    </items>
    <items>
      <name>Код2720c2021</name>
      <description>Стоимость имущества, полученного в порядке дарения, налоговая база по которому определяется в соответствии с пунктом 6 статьи 210</description>
    </items>
    <items>
      <name>Код2720</name>
      <description>Стоимость имущества, полученного в порядке дарения, за исключением доходов с кодом 2720</description>
    </items>
    <items>
      <name>Код2730</name>
      <description>Стоимость призов в денежной и натуральной форме на конкурсах и соревнованиях, проводимых в соотв. с решениями Правительства РФ и др. органов власти</description>
    </items>
    <items>
      <name>Код2740</name>
      <description>Стоимость выигрышей и призов, получаемых в проводимых конкурсах, играх и других мероприятиях в целях рекламы товаров, работ и услуг</description>
    </items>
    <items>
      <name>Код2760</name>
      <description>Материальная помощь, оказываемая работодателями своим работникам, а также бывшим своим работникам, уволившимся в связи с выходом на пенсию</description>
    </items>
    <items>
      <name>Код2761</name>
      <description>Материальная помощь, оказываемая инвалидам общественными организациями инвалидов</description>
    </items>
    <items>
      <name>Код2762</name>
      <description>Материальная помощь, оказываемая работодателями своим работникам при рождении (усыновлении) ребенка</description>
    </items>
    <items>
      <name>Код2763</name>
      <description>Материальная помощь, оказываемая образовательной организацией студентам (курсантам), аспирантам, адъюнктам, ординаторам и ассистентам-стажерам</description>
    </items>
    <items>
      <name>Код2770</name>
      <description>Возмещение (оплата) работодателями своим работникам и членам их семьи, бывшим своим работникам-пенсионерам, а также инвалидам стоимости медикаментов</description>
    </items>
    <items>
      <name>Код2790</name>
      <description>Сумма помощи (в денежной и натуральной форме), стоимость подарков, полученных ветеранами, инвалидами Великой Отечественной войны и приравненных к ним</description>
    </items>
    <items>
      <name>Код2791</name>
      <description>Доходы, полученные работниками в натуральной форме в качестве оплаты труда от с/х товаропроизводителей, упл-х ЕСХН, и крестьянских х-в</description>
    </items>
    <items>
      <name>Код3011</name>
      <description>Доходы в виде выигрышей, полученных от участия в лотерее</description>
    </items>
    <items>
      <name>Код4800</name>
      <description>Иные доходы</description>
    </items>
    <items>
      <name>Код2510</name>
      <description>Оплата за налогоплательщика товаров, работ, услуг или имущественных прав, в том числе коммунальных услуг, питания, отдыха, обучения в его интересах</description>
    </items>
    <items>
      <name>Код2520</name>
      <description>Доход, полученный налогоплательщиком в натуральной форме, в виде полной или частичной оплаты товаров, выполненных в его интересах работ, услуг.</description>
    </items>
    <items>
      <name>Код2530</name>
      <description>Оплата труда в натуральной форме</description>
    </items>
  </predefined>
  <attributes>
    <name>СтавкаНалогообложенияРезидента</name>
    <type>
      <types>EnumRef.НДФЛСтавкиНалогообложенияРезидента</types>
    </type>
  </attributes>
  <attributes>
    <name>НеОблагаетсяУНалоговогоАгента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПрименяемыйВНалоговойОтчетностиС2010Года</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВычетРассчитываетсяАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВычетПоУмолчанию</name>
    <type>
      <types>CatalogRef.ВидыВычетовНДФЛ</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмеетЕдинственныйВычет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СоответствуетОплатеТруда</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПрименяемыйВНалоговойОтчетностиС2021Года</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

erp3l/src/Catalogs/ВидыДоходовНДФЛ/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// ТехнологияСервиса.ВыгрузкаЗагрузкаДанных

// Возвращает реквизиты справочника, которые образуют естественный ключ для элементов справочника.
//
// Возвращаемое значение:
//  Массив из Строка - имена реквизитов, образующих естественный ключ.
//
Функция ПоляЕстественногоКлюча() Экспорт
	
	Результат = Новый Массив;
	
	Результат.Добавить("Код");
	
	Возврат Результат;
	
КонецФункции

// Конец ТехнологияСервиса.ВыгрузкаЗагрузкаДанных

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	ДанныеВыбораБЗК.ЗаполнитьДляКлассификатораСПорядкомПоКоду(
		Справочники.ВидыДоходовНДФЛ,
		ДанныеВыбора, Параметры, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура НачальноеЗаполнение() Экспорт
	
	ЗаполнитьКодыДоходовНДФЛ();
	СоздатьКодыДоходовНДФЛ();
	СоздатьКодыДоходовНДФЛДекабрь2011();
	ОбновлениеДоходовВычетовНДФЛНеПредопределенныхЯнварь2012();
	ЗаполнитьКодыДоходов2014();
	ЗаполнитьКодыДоходов2015();
	ЗаполнитьКодыДоходов2016();
	ЗаполнитьКодыДоходов2017();
	ЗаполнитьКодыДоходов2018();
	ЗаполнитьКодыДоходов2021();
	ОписатьКодыПодарков();	
	ОписатьДоходы3020и3023();
	
КонецПроцедуры

// Выполняет заполнение справочника "ВидыДоходовНДФЛ" не предопределенными элементами.
//
Процедура СоздатьКодыДоходовНДФЛ() Экспорт
	
	Ставка09 = Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка09;
	Ставка13 = Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка13;
	Ставка35 = Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка35;
	
	// Добавление непредопределенных кодов доходов.
	// АПК:1036-выкл: сокращения 
	ОписатьКодДоходаНДФЛ(, Ставка13, "1011", НСтр("ru = 'Проценты, включая дисконт, полученный по долговому обязательству любого вида (за исключением доходов с кодами 1110, 2800 и 3020).';
													|en = 'Interest, including a discount, earned on a debt liability of any kind (excluding income with codes 1110, 2800 and 3020).'"));
	ОписатьКодДоходаНДФЛ(, Ставка09, "1110", НСтр("ru = 'Проценты по облигациям с ипотечным покрытием, эмитированным до 01.01.2007';
													|en = 'Interest on mortgage-secured bonds issued before 01/01/2007'"));
	ОписатьКодДоходаНДФЛ(, Ставка09, "1120", НСтр("ru = 'Доходы учредителей доверительного управления ипотечным покрытием, полученные на основании приобретения ипотечных сертификатов, выданных до 01.01.2007';
													|en = 'Income of founders of mortgage-secured trust management received based on the acquisition of mortgage certificates issued before 01/01/2007'"));
	ОписатьКодДоходаНДФЛ(, Ставка13, "1200", НСтр("ru = 'Доходы, полученные в виде иных страховых выплат по договорам страхования';
													|en = 'Other insurance payouts under insurance contracts'"));
	ОписатьКодДоходаНДФЛ(, Ставка13, "1201", НСтр("ru = 'Доходы, полученные в виде страховых выплат по договорам страхования в виде оплаты стоимости санаторно-курортных путевок';
													|en = 'Insurance payouts under insurance contracts in the form of trip voucher reimbursements'")); 
	ОписатьКодДоходаНДФЛ(, Ставка13, "1202", НСтр("ru = 'Доходы, полученные в виде страховых выплат по договорам добровольного страхования жизни (за исключением добровольного пенсионного страхования)';
													|en = 'Insurance payouts under voluntary life insurance contracts (excluding voluntary retirement insurance)'")); 
	ОписатьКодДоходаНДФЛ(, Ставка13, "1203", НСтр("ru = 'Доходы, полученные в виде страховых выплат по договорам добровольного имущественного страхования (включая страхование гражданской ответственности)';
													|en = 'Insurance payouts under voluntary property insurance contracts (including civil liability insurance)'")); 
	ОписатьКодДоходаНДФЛ(, Ставка13, "1212", НСтр("ru = 'Доходы в виде денежных (выкупных) сумм, выплачиваемых по договорам страхования при досрочном расторжении договоров страхования';
													|en = 'Money paid under insurance contracts in case of early termination of the contract (surrender value)'"));
	ОписатьКодДоходаНДФЛ(, Ставка13, "1213", НСтр("ru = 'Доходы в виде денежных (выкупных) сумм при расторжении договора за вычетом сумм страховых взносов, уплаченных по договору добр. пенс. страхования';
													|en = 'Money paid in case of contract termination (surrender value) with the deduction of the amount of insurance premiums paid under a voluntary retirement insurance contract'")); 
	ОписатьКодДоходаНДФЛ(, Ставка13, "1220", НСтр("ru = 'Доходы в виде денежных (выкупных) сумм, выплачиваемые по договорам негосударственного пенсионного обеспечения';
													|en = 'Money paid under non-state pension provision contracts (surrender value)'"));
	ОписатьКодДоходаНДФЛ(, Ставка13, "1240", НСтр("ru = 'Суммы пенсий, выплачиваемых по договорам негосударственного пенсионного обеспечения';
													|en = 'Pension amounts paid under non-state pension provision contracts'"));
	ОписатьКодДоходаНДФЛ(, Ставка13, "1301", НСтр("ru = 'Доходы, полученные от отчуждения авторских или иных смежных прав';
													|en = 'Income received from alienation of copyright or other related rights'")); 
	ОписатьКодДоходаНДФЛ(, Ставка13, "1400", НСтр("ru = 'Доходы, полученные от сдачи в аренду или иного использования имущества, за исключением доходов с кодами 1401, 1402 и 2400';
													|en = 'Income received from lease or other use of property, excluding income with codes 1401, 1402, and 2400'"));
	ОписатьКодДоходаНДФЛ(, Ставка13, "1540", НСтр("ru = 'Доходы, полученные от реализации долей участия в уставном капитале организаций';
													|en = 'Income received from selling participatory interests in the charter capital of companies'"));
	ОписатьКодДоходаНДФЛ(, Ставка13, "1550", НСтр("ru = 'Доходы, полученные налогоплательщиком при уступке прав требования по договору участия в долевом строительстве (договору инвестирования и др.)';
													|en = 'Income received by a taxpayer upon cession of rights under a shared construction participation agreement (an investment contract, etc.)'"));
	ОписатьКодДоходаНДФЛ(, Ставка13, "2001", НСтр("ru = 'Вознаграждение директоров и иные аналогичные выплаты, получаемые членами органа управления организации (совета директоров или иного подобного органа)';
													|en = 'Remuneration of chief officers and other similar benefits received by members of the company management body (the executive board or other similar body)'"));
	ОписатьКодДоходаНДФЛ(, Ставка13, "2012", НСтр("ru = 'Суммы отпускных выплат';
													|en = 'Leave payment amounts'"));
	ОписатьКодДоходаНДФЛ(, Ставка13, "2300", НСтр("ru = 'Пособия по временной нетрудоспособности';
													|en = 'Temporary incapacity allowances'"));
	ОписатьКодДоходаНДФЛ(, Ставка13, "2400", НСтр("ru = 'Доходы от использования любых транспортных средств в связи с перевозками, включая штрафы; трубопроводов, ЛЭП, линий связи, компьютерных сетей';
													|en = 'Income from the use of any vehicle due to transportation, including fines; pipelines, power lines, communication lines, computer networks'"));
	ОписатьКодДоходаНДФЛ(, Ставка13, "2630", НСтр("ru = 'Материальная выгода, полученная от приобретения товаров, работ, услуг у физ. лиц, организаций, явл. взаимозависимыми по отношению к налогоплательщику';
													|en = 'Financial benefits gained from acquisition of goods, work and services from individuals and companies interdependent relative to a taxpayer'"));
	ОписатьКодДоходаНДФЛ(, Ставка13, "2640", НСтр("ru = 'Материальная выгода, полученная от приобретения ценных бумаг';
													|en = 'Financial benefits gained from security acquisition'"));
	ОписатьКодДоходаНДФЛ(, Ставка13, "2710", НСтр("ru = 'Материальная помощь (за исключением материальной помощи, учитываемой с кодами 2760 и 2761)';
													|en = 'Financial assistance (excluding financial assistance with codes 2760 and 2761)'"));
	ОписатьКодДоходаНДФЛ(, Ставка13, "2750", НСтр("ru = 'Стоимость призов в денежной и натуральной форме (за исключением стоимости призов, учитываемой с кодами 2730 и 2740)';
													|en = 'Prize cost in cash and in kind (excluding the prize cost accounted for with codes 2730 and 2740)'"));
	ОписатьКодДоходаНДФЛ(, Ставка13, "2780", НСтр("ru = 'Возмещение (оплата) стоимости приобретенных налогоплательщиком медикаментов в случаях, не подпадающих под действие п. 28 ст. 217 НК РФ';
													|en = 'Compensation (payment) of the cost of the purchased by the taxpayer medicines in cases not falling under cl. 28 of Art. 217 of the Tax Code of the Russian Federation'"));
	ОписатьКодДоходаНДФЛ(, Ставка13, "2800", НСтр("ru = 'Проценты (дисконт), полученные при оплате предъявленного к платежу векселя';
													|en = 'Interest (discount) received upon the bill for payment'"));
	ОписатьКодДоходаНДФЛ(, Ставка13, "2900", НСтр("ru = 'Доходы, полученные от операций с иностранной валютой';
													|en = 'Income received from foreign-exchange transactions'"));
	ОписатьКодДоходаНДФЛ(, Ставка13, "3010", НСтр("ru = 'Доходы в виде выигрышей, полученных от участия в азартных играх, проводимых в букмекерской конторе и тотализаторе';
													|en = 'Income received from participation in gambling games held in bookmaker''s offices and pari-mutuel betting offices'"));
	// АПК:1036-вкл 
	
КонецПроцедуры 

Функция ДоходыПоСтавке13(НалоговыйПериод) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыДоходовНДФЛ.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА ВидыДоходовНДФЛ.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.КодДоходаПоУмолчанию)
	|			ТОГДА 1
	|		КОГДА ВидыДоходовНДФЛ.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код2010)
	|			ТОГДА 3
	|		КОГДА ВидыДоходовНДФЛ.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код2760)
	|			ТОГДА 4
	|		КОГДА ВидыДоходовНДФЛ.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код2762)
	|			ТОГДА 4
	|		КОГДА ВидыДоходовНДФЛ.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код2720c2021)
	|			ТОГДА 5
	|		КОГДА ВидыДоходовНДФЛ.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код2720)
	|			ТОГДА 6
	|		КОГДА ВидыДоходовНДФЛ.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код4800)
	|			ТОГДА 6
	|		ИНАЧЕ 99
	|	КОНЕЦ КАК Порядок,
	|	ВидыДоходовНДФЛ.Код КАК Код
	|ИЗ
	|	Справочник.ВидыДоходовНДФЛ КАК ВидыДоходовНДФЛ
	|ГДЕ
	|	ВидыДоходовНДФЛ.СтавкаНалогообложенияРезидента = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка13)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	Код";
	
	Доходы = Новый Массив;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Доходы.Добавить(Выборка.Ссылка);
	КонецЦикла;
	Если НалоговыйПериод >= 2015 Тогда
		Доходы.Добавить(Справочники.ВидыДоходовНДФЛ.Код1010);
	КонецЕсли;
	
	Возврат Доходы;
	
КонецФункции

Функция ДоходыПоСтавке30(НалоговыйПериод) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыДоходовНДФЛ.Ссылка,
	|	ВидыДоходовНДФЛ.Код КАК Код
	|ИЗ
	|	Справочник.ВидыДоходовНДФЛ КАК ВидыДоходовНДФЛ
	|ГДЕ
	|	ВидыДоходовНДФЛ.Ссылка <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код1010)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Код";
	
	Доходы = Новый Массив;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Доходы.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Возврат Доходы;
	
КонецФункции

Функция ДоходыПоСтавке09(НалоговыйПериод) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыДоходовНДФЛ.Ссылка,
	|	ВидыДоходовНДФЛ.Код КАК Код
	|ИЗ
	|	Справочник.ВидыДоходовНДФЛ КАК ВидыДоходовНДФЛ
	|ГДЕ
	|	ВидыДоходовНДФЛ.Ссылка <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код1010)
	|	И ВидыДоходовНДФЛ.СтавкаНалогообложенияРезидента = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка09)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Код";
	
	Доходы = Новый Массив;
	Если НалоговыйПериод < 2015 Тогда
		Доходы.Добавить(Справочники.ВидыДоходовНДФЛ.Код1010);
	КонецЕсли;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Доходы.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Возврат Доходы;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДоступноСвойствоСоответствуетОплатеТруда() Экспорт
	
	ВидыДоходов = Новый Массив;
	ВидыДоходов.Добавить(Справочники.ВидыДоходовНДФЛ.Код2002);
	
	Возврат ВидыДоходов;
	
КонецФункции

Функция ВидыДоходовСоответствующиеОплатеТруда() Экспорт 
	
	ВидыДоходов = Новый Массив;
	ВидыДоходов.Добавить(Справочники.ВидыДоходовНДФЛ.КодДоходаПоУмолчанию);
	ВидыДоходов.Добавить(Справочники.ВидыДоходовНДФЛ.Код2530);
	
	Возврат ВидыДоходов;
	
КонецФункции

// Выполняет заполнение справочника "ВидыДоходовНДФЛ".
//
Процедура ЗаполнитьКодыДоходовНДФЛ()
	
	Ставка09 = Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка09;
	Ставка13 = Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка13;
	Ставка35 = Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка35;
	ВычетыНДФЛ = Справочники.ВидыВычетовНДФЛ;
	
	
	// Заполнение реквизитов предопределенных элементов.
	// АПК:1036-выкл: сокращения 
	ОписатьКодДоходаНДФЛ("Код1010", 			Ставка09, "1010", НСтр("ru = 'Дивиденды';
																		|en = 'Dividends'"), Ложь, Истина, ВычетыНДФЛ.Код601);
	ОписатьКодДоходаНДФЛ("Код1211", 			Ставка13, "1211", НСтр("ru = 'Доходы, полученные в виде сумм страховых взносов по договорам страхования, если указанные суммы вносятся за физических лиц из средств работодателей';
																		|en = 'Income received as insurance contributions under insurance contracts if these amounts are paid for individuals from employers'' funds'"), Ложь, Истина, ВычетыНДФЛ.Код607);
	ОписатьКодДоходаНДФЛ("Код1300", 			Ставка13, "1300", НСтр("ru = 'Доходы, полученные налогоплательщиком от использования в РФ авторских или иных смежных прав (кроме авторских вознаграждений)';
																		|en = 'Income received by a taxpayer from using copyrights or other neighboring rights in the Russian Federation (except for author''s royalties)'"));
	ОписатьКодДоходаНДФЛ("КодДоходаПоУмолчанию",Ставка13, "2000", НСтр("ru = 'Вознаграждение за выполнение трудовых или иных обязанностей; денежное содержание и иные налогооблагаемые выплаты военнослужащим и приравненным к ним';
																		|en = 'Remuneration for performance of labor or other liabilities; military pay and other taxable payments to military personnel and equal-status persons'"), , , , , Истина);
	ОписатьКодДоходаНДФЛ("Код2010", 			Ставка13, "2010", НСтр("ru = 'Выплаты по договорам гражданско-правового характера (за исключением авторских вознаграждений)';
																		|en = 'Payments under civil law contracts (excluding author''s royalties)'"), Ложь, Истина, ВычетыНДФЛ.Код403);
	ОписатьКодДоходаНДФЛ("Код2201", 			Ставка13, "2201", НСтр("ru = 'Авторские вознаграждения (вознаграждения) за создание литературных произведений, в том числе для театра, кино, эстрады и цирка';
																		|en = 'Author''s royalties (remunerations) for creating literary works, including those for theater, cinema, stage, and circus'"), Истина, Ложь, ВычетыНДФЛ.Код405);
	ОписатьКодДоходаНДФЛ("Код2202", 			Ставка13, "2202", НСтр("ru = 'Авторские вознаграждения (вознаграждения) за создание художественно-графических произведений, фоторабот для печати, произведений архитектуры и дизайна';
																		|en = 'Author''s royalties (remunerations) for creating art-graphic works, photography to print, works of architecture and design'"), Истина, Ложь, ВычетыНДФЛ.Код405);
	ОписатьКодДоходаНДФЛ("Код2203", 			Ставка13, "2203", НСтр("ru = 'Авторские вознаграждения (вознаграждения) за создание произведений скульптуры, живописи, театрально- и кинодекорационного искусства и графики';
																		|en = 'Author''s royalties (remunerations) for creating works of sculpture, artwork, theater and film decoration art and graphics'"), Истина, Ложь, ВычетыНДФЛ.Код405);
	ОписатьКодДоходаНДФЛ("Код2204", 			Ставка13, "2204", НСтр("ru = 'Авторские вознаграждения (вознаграждения) за создание аудиовизуальных произведений (видео-, теле- и кинофильмов)';
																		|en = 'Author''s royalties (remunerations) for creating audiovisual works (video, movies)'"), Истина, Ложь, ВычетыНДФЛ.Код405);
	ОписатьКодДоходаНДФЛ("Код2205", 			Ставка13, "2205", НСтр("ru = 'Авторские за создание музыкальных произведений: музыкально-сценических, симфонических, хоровых, камерных, для духового оркестра, для фильмов и театра';
																		|en = 'Author''s royalties for creating musical compositions: for musical stage, symphonic, choral, chamber, brass band, movies and theater'"), Истина, Ложь, ВычетыНДФЛ.Код405);
	ОписатьКодДоходаНДФЛ("Код2206", 			Ставка13, "2206", НСтр("ru = 'Авторские вознаграждения (вознаграждения) за создание других музыкальных произведений, в том числе подготовленных к опубликованию';
																		|en = 'Author''s royalties (remunerations) for creating other musical compositions, including those prepared for publication'"), Истина, Ложь, ВычетыНДФЛ.Код405);
	ОписатьКодДоходаНДФЛ("Код2207", 			Ставка13, "2207", НСтр("ru = 'Авторские вознаграждения (вознаграждения) за исполнение произведений литературы и искусства';
																		|en = 'Author''s royalties (remunerations) for performing works of literature and art'"), Истина, Ложь, ВычетыНДФЛ.Код405);
	ОписатьКодДоходаНДФЛ("Код2208", 			Ставка13, "2208", НСтр("ru = 'Авторские вознаграждения (вознаграждения) за создание научных трудов и разработок';
																		|en = 'Author''s royalties (remunerations) for creating scientific papers and developments'"), Истина, Ложь, ВычетыНДФЛ.Код405);
	ОписатьКодДоходаНДФЛ("Код2209", 			Ставка13, "2209", НСтр("ru = 'Авторские вознаграждения за открытия, изобретения, промышленные образцы';
																		|en = 'Author''s royalties for discoveries, inventions, industrial designs'"), Истина, Ложь, ВычетыНДФЛ.Код405);
	ОписатьКодДоходаНДФЛ("Код2210", 			Ставка13, "2210", НСтр("ru = 'Вознаграждение, выплачиваемое наследникам (правопреемникам) авторов произведений науки, литературы, искусства, открытий, изобретений и пром. образцов';
																		|en = 'Remuneration paid to successors of creators of works of science, literature, art, discoveries, inventions, and industrial designs'"));
	ОписатьКодДоходаНДФЛ("Код2510", 			Ставка13, "2510", НСтр("ru = 'Оплата за налогоплательщика товаров, работ, услуг или имущественных прав, в том числе коммунальных услуг, питания, отдыха, обучения в его интересах';
																		|en = 'Payment for the taxpayer of goods, works, services or property rights, including utilities, food, recreation, training in their interests'"));
	ОписатьКодДоходаНДФЛ("Код2520", 			Ставка13, "2520", НСтр("ru = 'Доход, полученный налогоплательщиком в натуральной форме, в виде полной или частичной оплаты товаров, выполненных в его интересах работ, услуг.';
																		|en = 'Income in kind received by the taxpayer as a full or partial payment for goods, works, services performed in their interest.'"));
	ОписатьКодДоходаНДФЛ("Код2530", 			Ставка13, "2530", НСтр("ru = 'Оплата труда в натуральной форме';
																		|en = 'Labor compensation in kind'"), , , , , Истина);
	ОписатьКодДоходаНДФЛ("Код2610",				Ставка35, "2610", НСтр("ru = 'Материальная выгода, полученная от экономии на процентах за пользование заемными (кредитными) средствами';
																			|en = 'Financial benefits gained from savings on interest for the use of borrowed (credit) funds'"));
	ОписатьКодДоходаНДФЛ("Код2730", 			Ставка13, "2730", НСтр("ru = 'Стоимость призов в денежной и натуральной форме на конкурсах и соревнованиях, проводимых в соотв. с решениями Правительства РФ и др. органов власти';
																		|en = 'Prize cost in cash and in kind received at contests and competitions held according to decisions of the RF Government and other authorities'"), Истина, Истина, ВычетыНДФЛ.Код502);
	ОписатьКодДоходаНДФЛ("Код2740", 			Ставка35, "2740", НСтр("ru = 'Стоимость выигрышей и призов, получаемых в проводимых конкурсах, играх и других мероприятиях в целях рекламы товаров, работ и услуг';
																		|en = 'Cost of prizes received in contests, games and other events for the purpose of advertising goods, works and services'"), Истина, Истина, ВычетыНДФЛ.Код505);
	ОписатьКодДоходаНДФЛ("Код2760", 			Ставка13, "2760", НСтр("ru = 'Материальная помощь, оказываемая работодателями своим работникам, а также бывшим своим работникам, уволившимся в связи с выходом на пенсию';
																		|en = 'Financial assistance provided by employers to their employees as well as to their former retired employees'"), Истина, Истина, ВычетыНДФЛ.Код503);
	ОписатьКодДоходаНДФЛ("Код2761", 			Ставка13, "2761", НСтр("ru = 'Материальная помощь, оказываемая инвалидам общественными организациями инвалидов';
																		|en = 'Financial assistance provided by public organizations to persons with disabilities'"), Истина, Истина, ВычетыНДФЛ.Код506);
	ОписатьКодДоходаНДФЛ("Код2762",				Ставка13, "2762", НСтр("ru = 'Материальная помощь, оказываемая работодателями своим работникам при рождении (усыновлении) ребенка';
																			|en = 'Financial assistance provided by employers to their employees upon the birth (adoption) of a child'"), Истина, Истина, ВычетыНДФЛ.Код508);
	ОписатьКодДоходаНДФЛ("Код2770", 			Ставка13, "2770", НСтр("ru = 'Возмещение (оплата) работодателями своим работникам и членам их семьи, бывшим своим работникам-пенсионерам, а также инвалидам стоимости медикаментов';
																		|en = 'Compensation (payment) of the medicine cost by employers to their employees and their family members, former retired employees as well as disabled people'"), Истина, Истина, ВычетыНДФЛ.Код504);
	ОписатьКодДоходаНДФЛ("Код2790", 			Ставка13, "2790", НСтр("ru = 'Сумма помощи (в денежной и натуральной форме), стоимость подарков, полученных ветеранами, инвалидами Великой Отечественной войны и приравненных к ним';
																		|en = 'The amount of support (in cash and in kind), the cost of gifts received by veterans and disabled veterans of the Great Patriotic War and equal-status persons'"), Истина, Истина, ВычетыНДФЛ.Код507);
	ОписатьКодДоходаНДФЛ("Код2791", 			Ставка13, "2791", НСтр("ru = 'Доходы, полученные работниками в натуральной форме в качестве оплаты труда от с/х товаропроизводителей, упл-х ЕСХН, и крестьянских х-в';
																		|en = 'Income in kind received by employees as labor compensation from agricultural producers paying the UAT and peasant enterprises'"), Ложь, Истина, ВычетыНДФЛ.Код509);
	ОписатьКодДоходаНДФЛ("Код4800", 			Ставка13, "4800", НСтр("ru = 'Иные доходы';
																		|en = 'Other income'"), Ложь, Истина, ВычетыНДФЛ.Код620);
	// АПК:1036-вкл 
	
КонецПроцедуры 

Процедура СоздатьКодыДоходовНДФЛДекабрь2011() 
	
	Ставка35 = Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка35;
	
	// АПК:1036-выкл: сокращения 
	ОписатьКодДоходаНДФЛ(, Ставка35, "3022", НСтр("ru = 'Доходы в виде платы за использование денежных средств членов кр.потреб.кооператива или %% за исп-е с-х кр.потреб.кооперативом займов (с 01.01.2011)';
													|en = 'Income as a payment for using cash of consumers credit union members or %% for using loans by agricultural consumer credit cooperative (from 01/01/2011)'"));
	// АПК:1036-вкл 

КонецПроцедуры	

Процедура ОбновлениеДоходовВычетовНДФЛНеПредопределенныхЯнварь2012()
	
	// АПК:1327-выкл используется при начальном заполнении ИБ.
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоходыНДФЛ.Ссылка
	|ИЗ
	|	Справочник.ВидыДоходовНДФЛ КАК ДоходыНДФЛ
	|ГДЕ
	|	ДоходыНДФЛ.Код = ""1541""
	|	И НЕ ДоходыНДФЛ.Предопределенный
	|	И НЕ ДоходыНДФЛ.ПометкаУдаления";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Объект = Выборка.Ссылка.ПолучитьОбъект();
		Объект.КодПрименяемыйВНалоговойОтчетностиС2010Года = "-";
		Объект.ПометкаУдаления = Истина;
		Объект.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
		Объект.Записать();
	КонецЕсли;
	
	// АПК:1327-вкл
	
КонецПроцедуры

Процедура ЗаполнитьКодыДоходов2014()
	
	Ставка13 = Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка13;
	ВычетыНДФЛ = Справочники.ВидыВычетовНДФЛ;	
	
	ОписатьКодДоходаНДФЛ("Код1530", Ставка13, "1530", НСтр("ru = 'Доходы, полученные по операциям с ценными бумагами, обращающимися на организованном рынке ценных бумаг';
															|en = 'Income received from transactions with securities converted on the security market'"), Ложь, Ложь, ВычетыНДФЛ.Код201);
	ОписатьКодДоходаНДФЛ("Код1531", Ставка13, "1531", НСтр("ru = 'Доходы, полученные от операций с ценными бумагами, не обращающимися  на  организованном  рынке  ценных бумаг';
															|en = 'Income received from transactions with securities not converted on the security market'"), Ложь, Ложь, ВычетыНДФЛ.Код202);
	ОписатьКодДоходаНДФЛ("Код1536", Ставка13, "1536", НСтр("ru = 'Доход полученные по операциям купли-продажи ценных бумаг, не обращающихся на организованном рынке ценных бумаг, но отвечавших его требованиям';
															|en = 'Income received from transactions of securities not converted on the organized securities market but meeting its requirements'"), Ложь, Ложь, ВычетыНДФЛ.Код203);
	ОписатьКодДоходаНДФЛ("Код1537", Ставка13, "1537", НСтр("ru = 'Доходы в виде процентов по займу, полученные по совокупности операций РЕПО';
															|en = 'Income as loan interest received under repo transactions'"), Ложь, Истина,   ВычетыНДФЛ.Код211);
	ОписатьКодДоходаНДФЛ("Код1538", Ставка13, "1538", НСтр("ru = 'Доходы в виде процентов, полученные в налоговом периоде по совокупности договоров займа';
															|en = 'Income as interest received in the fiscal period under loan agreements'"), Ложь, Истина, ВычетыНДФЛ.Код215);
	ОписатьКодДоходаНДФЛ("Код1539", Ставка13, "1539", НСтр("ru = 'Доходы по операциям, связанным с открытием короткой позиции, являющимся объектом операций РЕПО';
															|en = 'Income from opening a short position which is a repo transaction object'"), Ложь, Ложь, ВычетыНДФЛ.Код213);
	ОписатьКодДоходаНДФЛ("Код1541", Ставка13, "1541", НСтр("ru = 'Доходы, получаемые в результате обмена ценных бумаг, переданных по первой части РЕПО';
															|en = 'Income received from the exchange of securities transferred as repo opening'"), Ложь, Истина, ВычетыНДФЛ.Код620);
	
КонецПроцедуры	

Процедура ЗаполнитьКодыДоходов2015()
	
	Ставка13 = Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка13;
	
	// АПК:1036-выкл: сокращения 
	ОписатьКодДоходаНДФЛ(, Ставка13, "1215", НСтр("ru = 'Доходы в виде денежных (выкупных) сумм, выплачиваемые по договорам негосударственного пенсионного обеспечения';
													|en = 'Money paid under non-state pension provision contracts (surrender value)'"));
	ОписатьКодДоходаНДФЛ(, Ставка13, "1219", НСтр("ru = 'Суммы страховых взносов, в отношении которых был предоставлен социальный налоговый вычет, в случае расторжения договора добровольного пенс.страхования';
													|en = 'Amounts of insurance contributions with the social tax deduction provided if the voluntary pension insurance agreement is canceled'"));
	ОписатьКодДоходаНДФЛ(, Ставка13, "1220", НСтр("ru = 'Суммы страховых взносов, в отношении которых был предоставлен социальный налоговый вычет, учитыв. в случае расторжения негос. пенсионного обеспечения';
													|en = 'Amounts of insurance contributions with the social tax deduction provided, considered if the voluntary pension insurance agreement is canceled'"));
	ОписатьКодДоходаНДФЛ(, Ставка13, "1542", НСтр("ru = 'Доходы в виде действительной стоимости доли в уставном капитале организации, выплачиваемые при выходе участника из организации';
													|en = 'Income as a net cost of a share in the company''s authorized capital received upon cessation of membership'"));
	ОписатьКодДоходаНДФЛ(, Ставка13, "1550", НСтр("ru = 'Доходы, полученные при уступке прав требования по договору участия в долевом строительстве';
													|en = 'Income received upon assignment of claim under a shared construction participation agreement'"));
	// АПК:1036-вкл 
	
КонецПроцедуры	

Процедура ЗаполнитьКодыДоходов2016()
	
	Ставка13 = Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка13;
	ВычетыНДФЛ = Справочники.ВидыВычетовНДФЛ;	
	
	// АПК:1036-выкл: сокращения 
	ОписатьКодДоходаНДФЛ("Код1532", Ставка13, "1532", НСтр("ru = 'Доходы по опер. с произв.фин-выми инстр-ми, обр-ся на орг.рынке и базисным активом кот.явл. цен.бум., фонд.индексы, иные произв.фин-вые инстр-ты';
															|en = 'Income from transactions with derivative financial instruments converted on the organized market and whose underlying assets are securities, stock indices and other derivative financial instruments'"), Ложь, Ложь, ВычетыНДФЛ.Код205);
	ОписатьКодДоходаНДФЛ("Код1533", Ставка13, "1533", НСтр("ru = 'Доходы по операциям с производными финансовыми инструментами, не обращающимися на организованном рынке';
															|en = 'Income from the transactions with non-marketable derivative financial instruments'"), Ложь, Ложь, ВычетыНДФЛ.Код220);
	ОписатьКодДоходаНДФЛ("Код1535", Ставка13, "1535", НСтр("ru = 'Доходы по опер. с произв.фин-выми инстр-ми, обр-ся на орг.рынке и базисным активом кот. не явл. цен.бум., фонд.индексы, иные произв.фин-вые инстр-ты';
															|en = 'Income from transactions with derivative financial instruments converted on the organized market and whose underlying assets are not securities, stock indices and other derivative financial instruments'"), Ложь, Ложь, ВычетыНДФЛ.Код207);
	
	ОписатьКодДоходаНДФЛ("Код1543", Ставка13, "1543", НСтр("ru = '(не используется с 2016 года) Доходы по операциям, учитываемым на индивидуальном инвестиционном счете';
															|en = '(not used since 2016) Income from the transactions recorded on an individual investment account'"), Ложь, Ложь, ВычетыНДФЛ.ПустаяСсылка());
	
	ОписатьКодДоходаНДФЛ("Код1544", Ставка13, "1544", НСтр("ru = 'Доходы по операциям с ценными бумагами, обращающимися на организованном рынке ценных бумаг, учитываемым на индивидуальном инвестиционном счете';
															|en = 'Income from the transactions of marketable securities recorded on an individual investment account'"), Ложь, Ложь, ВычетыНДФЛ.Код221);
	ОписатьКодДоходаНДФЛ("Код1545", Ставка13, "1545", НСтр("ru = 'Доходы по операциям с ценными бумагами, не обращающимися на организованном рынке ценных бумаг, учитываемым на индивидуальном инвестиционном счете';
															|en = 'Income from transactions with non-marketable securities, recorded on an individual investment account'"), Ложь, Ложь, ВычетыНДФЛ.Код226);
	ОписатьКодДоходаНДФЛ("Код1546", Ставка13, "1546", НСтр("ru = 'Доходы по опер. с произв.фин-выми инстр-ми, обр-ся на орг.рынке и базисным активом кот.явл. цен.бум., фонд.индексы и пр., учит. на инд. инвест.счете';
															|en = 'Income from transactions with derivative financial instruments converted on the organized market and whose underlying assets are securities, stock indices and other; recorded on an individual investment account'"), Ложь, Ложь, ВычетыНДФЛ.Код228);
	ОписатьКодДоходаНДФЛ("Код1547", Ставка13, "1547", НСтр("ru = 'Доходы по операциям с производными финансовыми инструментами, не обращающимися на орг. рынке ценных бумаг, учитываемым на индивидуальном инвест.счете';
															|en = 'Income from the transactions with non-marketable derivative financial instruments recorded on an individual investment account'"), Ложь, Ложь, ВычетыНДФЛ.Код235);
	ОписатьКодДоходаНДФЛ("Код1548", Ставка13, "1548", НСтр("ru = 'Доходы по опер. с произв.фин-выми инстр., обр-ся на орг.рынке и базисным активом кот. не явл. цен.бум., фонд.индексы и пр., учит. на инд.инвест.счете';
															|en = 'Income from transactions with derivative financial instruments converted on the organized market and whose underlying assets are not securities, stock indices and other; recorded on an individual investment account'"), Ложь, Ложь, ВычетыНДФЛ.Код229);
	ОписатьКодДоходаНДФЛ("Код1549", Ставка13, "1549", НСтр("ru = 'Доходы по опер. с ценными бум., не обр-ся на орг.рынке ц.бумаг, кот. при приобретении отвечали треб-ям для обр-хся ц.бум., учит. на инд. инвест.счете';
															|en = 'Income from the transactions of securities that were not converted but met the requirements of the organized securities market and recorded on an individual investment account'"), Ложь, Ложь, ВычетыНДФЛ.Код227);
	
	ОписатьКодДоходаНДФЛ("Код1551", Ставка13, "1551", НСтр("ru = 'Доходы в виде процентов по займу, полученные по совокупности операций РЕПО, учитываемых на индивидуальном инвестиционном счете';
															|en = 'Income as a loan interest received for repo transactions recorded on an individual investment account'"), Ложь, Ложь, ВычетыНДФЛ.Код230);
	ОписатьКодДоходаНДФЛ("Код1552", Ставка13, "1552", НСтр("ru = 'Доходы в виде процентов, полученных в налоговом периоде по совокупности договоров займа, учитываемых на индивидуальном инвестиционном счете';
															|en = 'Income as an interest received in the fiscal period under loan agreements recorded on an individual investment account'"), Ложь,Ложь, ВычетыНДФЛ.Код232);
	ОписатьКодДоходаНДФЛ("Код1553", Ставка13, "1553", НСтр("ru = 'Доходы по операциям, связанным с открытием короткой позиции, являющимся объектом операций РЕПО, учитываемых на индивидуальном инвестиционном счете';
															|en = 'Income from opening a short position which is a repo transaction object recorded on an individual investment account'"), Ложь,Ложь, ВычетыНДФЛ.Код231);
	ОписатьКодДоходаНДФЛ("Код1554", Ставка13, "1554", НСтр("ru = 'Доходы, получаемые в результате обмена ценных бумаг, переданных по первой части РЕПО, учитываемых на индивидуальном инвестиционном счете';
															|en = 'Income received from the exchange of securities transferred as repo opening and recorded on an individual investment account'"));
	
	ОписатьКодДоходаНДФЛ("Код2002", Ставка13, "2002", НСтр("ru = 'Суммы премий за производственные результаты, предусмотренные зак-вом РФ, трудовыми (коллективными) договорами кроме доходов с кодом 2003';
															|en = 'Amounts of bonuses for production results under the legislation of the Russian Federation, employment contracts (collective bargaining agreements) except for income with 2003 code'"));
	ОписатьКодДоходаНДФЛ("Код2003", Ставка13, "2003", НСтр("ru = 'Суммы вознаграждений, выплачиваемых за счет средств прибыли организации, средств специального назначения или целевых поступлений';
															|en = 'Amounts of remuneration paid from the company profit funds, special purpose funds or special purpose receipts'"));
	
	ОписатьКодДоходаНДФЛ(, Ставка13, "2641", НСтр("ru = 'Материальная выгода, полученная от приобретения производных финансовых инструментов';
													|en = 'Financial gain from derivative financial instruments'"));
	ОписатьКодДоходаНДФЛ("Код2791", Ставка13, "2791", НСтр("ru = '(не используется с 2016 года) Доходы, полученные работниками в натуральной форме в качестве оплаты труда от с/х товаропроизводителей, упл-х ЕСХН, и крестьянских х-в';
															|en = '(not used since 2016) Income in kind received by employees as labor compensation from agricultural producers paying the UAT and peasant enterprises'"), Ложь, Ложь, ВычетыНДФЛ.ПустаяСсылка());
	ОписатьКодДоходаНДФЛ(, Ставка13, "3010", НСтр("ru = 'Доходы в виде выигрышей, полученных в букмекерской конторе и тотализаторе';
													|en = 'Income from gambling prizes received in bookmaker''s offices and pari-mutuel betting offices'"));
	// АПК:1036-вкл 
	
КонецПроцедуры	

Процедура ЗаполнитьКодыДоходов2017()
	
	Ставка13 = Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка13;
	
	ОписатьКодДоходаНДФЛ("Код2013", Ставка13, "2013", НСтр("ru = 'Сумма компенсации за неиспользованный отпуск';
															|en = 'Leave compensation amount'"));
	
КонецПроцедуры

Процедура ЗаполнитьКодыДоходов2018()
	
	Ставка13 = Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка13;
	
	ОписатьКодДоходаНДФЛ("Код2014", Ставка13, "2014", НСтр("ru = 'Сумма выплаты в виде выходного пособия, среднего месячного заработка, превышающей 3-х кратный размер среднего заработка';
															|en = 'Amount of the payment as a severance pay, average monthly earnings exceeding average earnings three times'"));
	ОписатьКодДоходаНДФЛ( , Ставка13, "2301", НСтр("ru = 'Суммы штрафов и неустойки, выплачиваемые на основании решения суда за несоблюдение удовлетворения требований потребителей';
													|en = 'Amounts of fines and forfeits paid due to the failure to meet customer requirements based on the court decision'"));
	ОписатьКодДоходаНДФЛ( , Ставка13, "2611", НСтр("ru = 'Суммы прекращенных обязательств по уплате задолженности в связи с признанием такой задолженности в установленном порядке безнадежной к взысканию';
													|en = 'Amounts of terminated liabilities of the debt repayment due to acknowledgment of the debt as uncollectible'"));
	
КонецПроцедуры

Процедура ИсправитьОписаниеКода2210() Экспорт
	
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Справочники.ВидыДоходовНДФЛ.Код2210, "НеОблагаетсяУНалоговогоАгента") Тогда
		// АПК:1036-выкл: сокращения 
		ОписатьКодДоходаНДФЛ("Код2210", Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка13, "2210", НСтр("ru = 'Вознаграждение, выплачиваемое наследникам (правопреемникам) авторов произведений науки, литературы, искусства, открытий, изобретений и пром. образцов';
																												|en = 'Remuneration paid to successors of creators of works of science, literature, art, discoveries, inventions, and industrial designs'"));
		// АПК:1036-вкл 
	КонецЕсли;
	
КонецПроцедуры 

Процедура ИсправитьОписаниеКода3023() Экспорт
	
	ИсправитьСтавкуДоходаНа35Процентов("3023");	
	
КонецПроцедуры 

Процедура ЗаполнитьКодыДоходов2021() Экспорт
	
	Ставка13 = Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка13;
	
	ОписатьКодДоходаНДФЛ(, Ставка13, "1401", НСтр("ru = 'Доходы, полученные от сдачи в аренду или иного использования жилого недвижимого имущества';
													|en = 'Income from rental or other use of the residential real estate'"));
	ОписатьКодДоходаНДФЛ(, Ставка13, "1402", НСтр("ru = 'Доходы, полученные от сдачи в аренду или иного использования недвижимого имущества, за исключением доходов с кодом 1401';
													|en = 'Income received from lease or other use of real estate, excluding income with code 1401'"));
	ОписатьКодДоходаНДФЛ("Код1500", Ставка13, "1500", НСтр("ru = 'Доходы по договорам купли-продажи (мены) ценных бумаг, налогообложение которых производится в соответствии с абзацем третьим пункта 1 статьи 226 НК РФ';
															|en = 'Income under securities purchase (exchange) agreements whose taxation is carried out in accordance with paragraph 3 of clause 1 of Article 226 of the RF Tax Code'"));
	ОписатьКодДоходаНДФЛ("Код2004", Ставка13, "2004", НСтр("ru = 'Суммы выплат ежемесячного денежного вознаграждения за классное руководство педагогическим работникам за счет средств федерального бюджета';
															|en = 'Amounts of monthly monetary remuneration payment for classroom leadership to teachers from federal budget funds'"),,,,, Истина);
	Код2017 = Справочники.ВидыДоходовНДФЛ.НайтиПоКоду("2017");
	Если ЗначениеЗаполнено(Код2017) Тогда
		ОписатьКодДоходаНДФЛ(Код2017, Ставка13, "2015",,,,,,,"2015");
	Иначе
		ОписатьКодДоходаНДФЛ(, Ставка13, "2015", НСтр("ru = 'Суточные, превышающие 700 рублей за каждый день в командировке на территории РФ и не более 2 500 рублей за каждый день в командировке за пределами РФ';
														|en = 'Daily allowance exceeding 700 rubles for each day on a business trip within the RF and not more than 2,500 rubles for each day on a business trip outside the RF'"));
	КонецЕсли;
	ОписатьКодДоходаНДФЛ(, Ставка13, "2611", НСтр("ru = 'Суммы прекращенных обязательств по уплате задолженности в связи с признанием такой задолженности в установленном порядке безнадежной к взысканию';
													|en = 'Amounts of terminated liabilities of the debt repayment due to acknowledgment of the debt as uncollectible'"));
	ОписатьКодДоходаНДФЛ("Код2763",	Ставка13, "2763", НСтр("ru = 'Материальная помощь, оказываемая образовательной организацией студентам (курсантам), аспирантам, адъюнктам, ординаторам и ассистентам-стажерам';
																|en = 'Support payment provided by the educational institution to students (cadets), graduate students, adjuncts, resident doctors and assistant trainees'"), Истина, Истина, Справочники.ВидыВычетовНДФЛ.Код511, , , "2763");
	ОписатьКодДоходаНДФЛ(, Ставка13, "3010", НСтр("ru = 'Доходы в виде выигрышей, полученных от участия в азартных играх, проводимых в букмекерской конторе и тотализаторе';
													|en = 'Income received from participation in gambling games held in bookmaker''s offices and pari-mutuel betting offices'"));
	ОписатьКодДоходаНДФЛ("Код3011", Ставка13, "3011", НСтр("ru = 'Доходы в виде выигрышей, полученных от участия в лотерее';
															|en = 'Income received from lottery'"));
	
КонецПроцедуры

Процедура ВосстановитьКоды1400и2400() Экспорт
	
	Ставка13 = Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка13;
	
	ОписатьКодДоходаНДФЛ(, Ставка13, "1400", НСтр("ru = 'Доходы, полученные от сдачи в аренду или иного использования имущества, за исключением доходов с кодами 1401, 1402 и 2400';
													|en = 'Income received from lease or other use of property, excluding income with codes 1401, 1402, and 2400'"));
	ОписатьКодДоходаНДФЛ(, Ставка13, "2400", НСтр("ru = 'Доходы от использования любых транспортных средств в связи с перевозками, включая штрафы; трубопроводов, ЛЭП, линий связи, компьютерных сетей';
													|en = 'Income from the use of any vehicle due to transportation, including fines; pipelines, power lines, communication lines, computer networks'"));
	
КонецПроцедуры

Процедура ПереименоватьКодыДоходовДекабрь2021() Экспорт
	
	Ставка13 = Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка13;
	
	ОписатьКодДоходаНДФЛ(, Ставка13, "1401", НСтр("ru = 'Доходы, полученные от сдачи в аренду или иного использования жилого недвижимого имущества';
													|en = 'Income from rental or other use of the residential real estate'"));
	ОписатьКодДоходаНДФЛ(, Ставка13, "1402", НСтр("ru = 'Доходы, полученные от сдачи в аренду или иного использования недвижимого имущества, за исключением доходов с кодом 1401';
													|en = 'Income received from lease or other use of real estate, excluding income with code 1401'"));
	Код2017 = Справочники.ВидыДоходовНДФЛ.НайтиПоКоду("2017");
	Если ЗначениеЗаполнено(Код2017) Тогда
		ОписатьКодДоходаНДФЛ(Код2017, Ставка13, "2015",,,,,,,"2015");
	КонецЕсли;
	
КонецПроцедуры

Процедура ОписатьКодыПодарков() Экспорт

	Ставка13 = Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка13;
	ВычетыНДФЛ = Справочники.ВидыВычетовНДФЛ;	
	ОписатьКодДоходаНДФЛ("Код2720", 	 Ставка13, "2721", НСтр("ru = 'Стоимость имущества, полученного в порядке дарения, за исключением доходов с кодом 2720';
																|en = 'Cost of donated property, excluding income with code 2720'"), Истина, Истина, ВычетыНДФЛ.Код501, , , "2720");
	ОписатьКодДоходаНДФЛ("Код2720c2021", Ставка13, "2720", НСтр("ru = 'Стоимость имущества, полученного в порядке дарения, налоговая база по которому определяется в соответствии с пунктом 6 статьи 210';
																|en = 'Cost of donated property whose tax base is defined in accordance with clause 6 of article 210'"), Истина, Истина, ВычетыНДФЛ.Код501, , , "-");

КонецПроцедуры

Процедура ПроставитьКод2021Года() Экспорт
	
	// АПК:1327-выкл используется при начальном заполнении ИБ.
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыДоходовНДФЛ.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыДоходовНДФЛ КАК ВидыДоходовНДФЛ
	|ГДЕ
	|	ВидыДоходовНДФЛ.КодПрименяемыйВНалоговойОтчетностиС2021Года = """"";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Объект = Выборка.Ссылка.ПолучитьОбъект();
		Объект.КодПрименяемыйВНалоговойОтчетностиС2021Года = Объект.КодПрименяемыйВНалоговойОтчетностиС2010Года;
		Если Выборка.Ссылка = Справочники.ВидыДоходовНДФЛ.Код2720 Тогда
			Объект.КодПрименяемыйВНалоговойОтчетностиС2021Года = "2721";
		КонецЕсли;
		Если Выборка.Ссылка = Справочники.ВидыДоходовНДФЛ.Код2720c2021 Тогда
			Объект.КодПрименяемыйВНалоговойОтчетностиС2010Года = "-";
			Объект.КодПрименяемыйВНалоговойОтчетностиС2021Года = "2720";
		КонецЕсли;
		Объект.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
		Объект.Записать();
		
	КонецЦикла;
	
	// АПК:1327-вкл
	
КонецПроцедуры

Процедура ОписатьДоходы3020и3023() Экспорт

	Ставка13 = Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка13;
	Ставка35 = Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка35;
	ОписатьКодДоходаНДФЛ(, Ставка13, "3020_2021", НСтр("ru = 'Доходы в виде процентов, получаемых по вкладам в банках';
														|en = 'Income in the form interest received on deposits in banks'"),,,, Истина,, "-", "3020");
	ОписатьКодДоходаНДФЛ(, Ставка35, "3020", НСтр("ru = 'Доходы в виде процентов, получаемых по вкладам в банках';
													|en = 'Income in the form interest received on deposits in banks'"),,,,,,,"-");
	ОписатьКодДоходаНДФЛ(, Ставка13, "3023_2021", НСтр("ru = 'Сумма дохода, получаемого по обращающимся облигациям, номинированным в рублях и эмитированным после 1 января 2017 года';
														|en = 'Amount of income received on marketable bonds ruble-denominated and issued after 01/01/2017'"),,,,,, "-", "3023");
	ОписатьКодДоходаНДФЛ(, Ставка35, "3023", НСтр("ru = 'Сумма дохода, получаемого по обращающимся облигациям, номинированным в рублях и эмитированным после 1 января 2017 года';
													|en = 'Amount of income received on marketable bonds ruble-denominated and issued after 01/01/2017'"),,,,,,,"-");

КонецПроцедуры


// АПК:134-выкл: унаследовано 
// АПК:142-выкл: унаследовано 
Процедура ОписатьКодДоходаНДФЛ(СсылкаИлиИмяПредопределенныхДанных = Неопределено, СтавкаНалогообложения = Неопределено, Код = "", Наименование = "", ВычетРассчитываетсяАвтоматически = Ложь, ИмеетЕдинственныйВычет = Ложь, ВычетПоУмолчанию = Неопределено, НеОблагаетсяУНалоговогоАгента = Ложь, СоответствуетОплатеТруда = Ложь, КодПрименяемыйВНалоговойОтчетностиС2010Года = "", КодПрименяемыйВНалоговойОтчетностиС2021Года = "")

	Если ТипЗнч(СсылкаИлиИмяПредопределенныхДанных) = Тип("Строка") И Не ПустаяСтрока(СсылкаИлиИмяПредопределенныхДанных) Тогда
		
		СсылкаПредопределенного = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыДоходовНДФЛ." + СсылкаИлиИмяПредопределенныхДанных);
		Если ЗначениеЗаполнено(СсылкаПредопределенного) Тогда
			Элемент = СсылкаПредопределенного.ПолучитьОбъект();
		Иначе
			Элемент = Справочники.ВидыДоходовНДФЛ.СоздатьЭлемент();
			Элемент.ИмяПредопределенныхДанных = СсылкаИлиИмяПредопределенныхДанных;
		КонецЕсли;
		
	Иначе
		
		Если ЗначениеЗаполнено(СсылкаИлиИмяПредопределенныхДанных) Тогда
			СсылкаНаЭлемент = СсылкаИлиИмяПредопределенныхДанных;
		Иначе
			СсылкаНаЭлемент = Справочники.ВидыДоходовНДФЛ.НайтиПоКоду(Код);
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(СсылкаНаЭлемент) Тогда
			Элемент = СсылкаНаЭлемент.ПолучитьОбъект();
		Иначе
			Элемент = Справочники.ВидыДоходовНДФЛ.СоздатьЭлемент();
		КонецЕсли;
		
	КонецЕсли;

	Если ЗначениеЗаполнено(Код) Тогда
		Элемент.Код = Код;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Наименование) Тогда
		Элемент.Наименование = Наименование;
	КонецЕсли;

	Элемент.КодПрименяемыйВНалоговойОтчетностиС2010Года	= ?(Не ЗначениеЗаполнено(КодПрименяемыйВНалоговойОтчетностиС2010Года), Элемент.Код, КодПрименяемыйВНалоговойОтчетностиС2010Года);
	Элемент.КодПрименяемыйВНалоговойОтчетностиС2021Года	= ?(Не ЗначениеЗаполнено(КодПрименяемыйВНалоговойОтчетностиС2021Года), Элемент.Код, КодПрименяемыйВНалоговойОтчетностиС2021Года);
	Элемент.СтавкаНалогообложенияРезидента		= ?(Не ЗначениеЗаполнено(СтавкаНалогообложения), Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка13, СтавкаНалогообложения);
	Элемент.ВычетПоУмолчанию					= ВычетПоУмолчанию;
	Элемент.ВычетРассчитываетсяАвтоматически	= ВычетРассчитываетсяАвтоматически;
	Элемент.ИмеетЕдинственныйВычет				= ИмеетЕдинственныйВычет;
	Элемент.НеОблагаетсяУНалоговогоАгента		= НеОблагаетсяУНалоговогоАгента;
	Элемент.СоответствуетОплатеТруда			= СоответствуетОплатеТруда;
	
	Элемент.ОбменДанными.Загрузка = Истина;
	Элемент.Записать();

КонецПроцедуры

Процедура ИсправитьСтавкуДоходаНа35Процентов(Код, ВычетРассчитываетсяАвтоматически = Ложь, ИмеетЕдинственныйВычет = Ложь, ВычетПоУмолчанию = Неопределено)

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВидыДоходовНДФЛ.Ссылка
	|ИЗ
	|	Справочник.ВидыДоходовНДФЛ КАК ВидыДоходовНДФЛ
	|ГДЕ
	|	ВидыДоходовНДФЛ.Код = ""ХХ""
	|	И ВидыДоходовНДФЛ.СтавкаНалогообложенияРезидента <> ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка35)";
	
	Запрос = Новый Запрос;
	Запрос.Текст = СтрЗаменить(ТекстЗапроса, "ХХ", Код);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ОписатьКодДоходаНДФЛ(Выборка.Ссылка, Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка35, , , ВычетРассчитываетсяАвтоматически, ИмеетЕдинственныйВычет, ВычетПоУмолчанию);
	КонецЕсли;	

КонецПроцедуры

#КонецОбласти

#КонецЕсли
